app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username = 'validuser') LIMIT 1
UPDATE "users" SET "valid_token" = 'bgcdadjoofmejkpnjdcicpfmfoeohjam', "updated_at" = '2013-04-07 23:47:30.279943' WHERE "users"."id" = 1
---
  def resetUserToSeed
    @INITIAL_TOKEN = "bgcdadjoofmejkpnjdcicpfmfoeohjam"
    @user_model = User.where("username = ?", params[:user]).first
    setKey(@user_model.valid_token)
    @msgReceivedDecrypted = decrypt(params[:msgContent])
    puts "Decrypted: " + @msgReceivedDecrypted
    @user_model.valid_token = @INITIAL_TOKEN
    @user_model.token_rotation_count = 0

    if @user_model.save

SELECT "users".* FROM "users" WHERE (username = 'juan') LIMIT 1
---
  def authenticateUser
    @user_model = User.where("username = ?", params[:user]).first

SELECT "users".* FROM "users" WHERE (username = 'juan') LIMIT 1
UPDATE "users" SET "valid_token" = 'chdebekppgnfklqokedjdqgngpfpikbn', "token_rotation_count" = 2, "updated_at" = '2013-04-07 23:53:12.197203' WHERE "users"."id" = 1
---
  def endAuthenticateUser
    @user_model = User.where("username = ?", params[:user]).first
    puts "user found: "+@user_model.inspect
    setKey(@user_model.valid_token)
    @msgReceivedDecrypted = decrypt(params[:msgContent])
    puts "MsgsReceivedDecrypted: "+@msgReceivedDecrypted

    s_response = {
      msg: "ENDED_SESSION_SUCCESFULLY",
      expires: Time.now + 1.hour
    }

    f_response = {
        msg: "NOT_AUTHORIZED"
    }

    if @msgReceivedDecrypted == "DISCONNECT"
      @user_model.valid_token = @user_model.valid_token.split.map { |w| to_caesar(w, @user_model.token_rotation_count) }.join(' ')
      @user_model.token_rotation_count = @user_model.token_rotation_count + 1

      if @user_model.save!

SELECT "users".* FROM "users" WHERE (username = 'validuser') LIMIT 1
SELECT "users".* FROM "users"
---
  def index
    @user_model = User.where("username = ?", params[:user]).first

    puts "user found: "+@user_model.inspect
    setKey(@user_model.valid_token)
    @msgReceivedDecrypted = decrypt(params[:msgContent])
    puts "MsgsReceivedDecrypted: "+@msgReceivedDecrypted


    if @msgReceivedDecrypted == "REQUESTCONFIDENTIALLISTOFUSERS"
      @users = User.all

INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save